yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

/* Draw lip keypoints using SMOOTHED positions (reduces jitter). Offsets correct placement. */
static void DrawLipLandmark(
    const float *smoothedLipX, const float *smoothedLipY,
    image_t *drawImg
)
{
	int lipColor = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int drawX = (int)smoothedLipX[i] + LIP_OFFSET_X;
		int drawY = (int)smoothedLipY[i] + LIP_OFFSET_Y;
		imlib_draw_circle(drawImg, drawX, drawY, 2, lipColor, 1, true);
	}
}

/* Apply EMA smoothing to reduce jitter. smoothed = alpha*raw + (1-alpha)*prev */
static void ApplyLipSmoothing(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int prevFaceIdx, int posOffsetX, int posOffsetY,
    float *outSmoothedX, float *outSmoothedY
)
{
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;
        float rawX = posOffsetX + (float)results_KP[idx].m_x;
        float rawY = posOffsetY + (float)results_KP[idx].m_y;
        if (prevFaceIdx >= 0 && prevFaceIdx < MAX_TRACKED_FACES && s_asPrevLipState[prevFaceIdx].valid) {
            outSmoothedX[i] = LANDMARK_SMOOTHING_ALPHA * rawX + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipX[i];
            outSmoothedY[i] = LANDMARK_SMOOTHING_ALPHA * rawY + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipY[i];
        } else {
            outSmoothedX[i] = rawX;
            outSmoothedY[i] = rawY;
        }
    }
}

/* MAR: vertical/horizontal extent of lip+chin bbox. Chin (152) captures jaw drop when speaking. */
static float ComputeMAR(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    const float *smoothedLipX, const float *smoothedLipY,
    int posOffsetX, int posOffsetY
)
{
    if (results_KP.size() < 468) return 0.0f;
    float minX = 1e9f, maxX = -1e9f, minY = 1e9f, maxY = -1e9f;
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        if (smoothedLipX[i] < minX) minX = smoothedLipX[i];  if (smoothedLipX[i] > maxX) maxX = smoothedLipX[i];
        if (smoothedLipY[i] < minY) minY = smoothedLipY[i];  if (smoothedLipY[i] > maxY) maxY = smoothedLipY[i];
    }
    for (int i = 0; i < MAR_EXTRA_INDICES_NUM; i++) {
        int idx = s_i32MarExtraIndices[i];
        if (idx < (int)results_KP.size()) {
            float x = posOffsetX + (float)results_KP[idx].m_x;
            float y = posOffsetY + (float)results_KP[idx].m_y;
            if (x < minX) minX = x;  if (x > maxX) maxX = x;
            if (y < minY) minY = y;  if (y > maxY) maxY = y;
        }
    }
    float horiz = maxX - minX;
    float vert = maxY - minY;
    if (horiz < 2.0f) return 0.0f;
    return vert / horiz;
}

/* Compute lip velocity using SMOOTHED positions (reduces jitter-induced false velocity) */
static float ComputeLipVelocity(
    const float *smoothedLipX, const float *smoothedLipY,
    int prevFaceIdx
)
{
    float velocity = 0.0f;
    int validPoints = 0;

    if (prevFaceIdx < 0 || prevFaceIdx >= MAX_TRACKED_FACES || !s_asPrevLipState[prevFaceIdx].valid)
        return 0.0f;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        float dx = smoothedLipX[i] - s_asPrevLipState[prevFaceIdx].lipX[i];
        float dy = smoothedLipY[i] - s_asPrevLipState[prevFaceIdx].lipY[i];
        velocity += (float)std::sqrt(dx*dx + dy*dy);
        validPoints++;
    }
    return (validPoints > 0) ? (velocity / validPoints) : 0.0f;
}

/* Find best-matching previous face by bbox center distance (for face order changes) */
static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) continue;
        int prevCx = s_asPrevLipState[j].x0 + s_asPrevLipState[j].w / 2;
        int prevCy = s_asPrevLipState[j].y0 + s_asPrevLipState[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx*dx + dy*dy);
        if (dist < bestDist && dist < (float)(curW + curH)) {  /* Allow face to move within ~2x face size */
            bestDist = dist;
            bestIdx = j;
        }
    }
    return bestIdx;
}

/* Store SMOOTHED lip positions for next frame's velocity + EMA */
static void StoreLipPositions(
    const float *smoothedLipX, const float *smoothedLipY,
    int storeIdx, int faceX0, int faceY0, int faceW, int faceH
)
{
    if (storeIdx >= MAX_TRACKED_FACES || storeIdx < 0) return;
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        s_asPrevLipState[storeIdx].lipX[i] = smoothedLipX[i];
        s_asPrevLipState[storeIdx].lipY[i] = smoothedLipY[i];
    }
    s_asPrevLipState[storeIdx].x0 = faceX0;
    s_asPrevLipState[storeIdx].y0 = faceY0;
    s_asPrevLipState[storeIdx].w = faceW;
    s_asPrevLipState[storeIdx].h = faceH;
    s_asPrevLipState[storeIdx].valid = 1;
}

